// 获取画布元素和上下文
let canvasEl = document.getElementById('canvas')
let context = canvasEl.getContext('2d')

// 初始化
// 创建地图 ：4*4 二维数组来存放每个格子的状态，值为0代表为空，
// 值为其他数字表示这个格子上的方块的数字
let map = [
  [0, 0, 0, 0],
  [0, 0, 0, 0],
  [0, 0, 0, 0],
  [0, 0, 0, 0]
]
// 不同数字的颜色信息
let num_colors = {
  0:"#ccc0b3",2:"#eee4da",4:"#ede0c8",8:"#f2b179",
  16:"#f59563",32:"#f67c5f",64:"#ec6544",128:"#e44d29",
  256:"#edcf72",512:"#c8a145",1024:"#a8832b",2048:"#86aa9c"
}
// 不同数字的大小信息
let num_sizes = {
  0:"60",2:"60",4:"60",8:"60",
  16:"60",32:"60",64:"60",128:"50",
  256:"50",512:"50",1024:"40",2048:"40"
}
// 不同数字的偏移量（为了将数字画在方块中心）
let offsetx = {
  0:65,2:65,4:65,8:65,
  16:40,32:40,64:40,128:15,
  256:15,512:15,1024:-10,2048:-10
}
// 上下左右键的code对应的方向信息
let directionMap = {
  '38':[0,-1],'40':[0,1],'37':[-1,0],'39':[1,0]
}
// space 表示当前剩余的空格块数， score 表示当前的分数
let space = 16, score = 0;

// TODO: 绘制4*4游戏方格，随机生成2方块


